-------------------------------------eigrp---------------------------------------------
Configuration de l'ID de routeur EIGRP
Router(config)# router eigrp (autonomous-system)
Router(config-router)# eigrp router-id (ipv4-address)
R1(config-router)# network 1.1.1.0  0.0.0.255
R1(config-router)# network 2.2.2.0  0.0.0.255
Authentication    R1(config-router)# key chain EIGRP_KEY
R1(config-keychain)# key 1
R1(config- keychain-key)# key-string P@ssw0rd
R1(config-router)# int f0/0    R1(config-if)# ip authentication mode eigrp 10 md5
R1(config-if)# ip authentication key-chain eigrp 10 EIGRP_KEY
Configurtion d’une interface de bouclage (Loopback Interface)
Router(config)# interface loopback number
Router(config-if)# ip (addressipv4-address) (subnet-mask)
Configurez d’une route récapitulative manuelle
R1(config)# interface S0/0/0
R1(config-if)# ip summary-address eigrp 1 192.168.0.0 255.255.255.0
Par défaut, la commande de mode de configuration du routeur 
eigrp log-neighbor-changes est activée.

utilisez l'option wildcard-mask avec la commande network soit: 	
R1(config-router)# network (network-address) [masque générique wildcard-mask]

Pour configurer:	
R1(config)# router (eigrp as-number)
R1(config-router)# passive-interface (interface-type) (interface-number)

Pour verifier:	Router# show ip protocols	-	show ip eigrp neighbors

Métrique composite EIGRP
R1 (config-router) # metric weights tos k1 k2 k3 k4 k5        
K1 (bande passante) = 1   K2 (charge) = 0   K3 (délai) = 1   K4 (fiabilité)=0   K5 (fiabilité) = 0

Métrique de bande passante
R1(config)# interface f0/0
R1(config-if)# bandwidth 64

Table topologique : commande 
show ip eigrp topology	via 1.1.1.1 (distance de faisabilité/distance annoncée du successeur) f0/0

Table topologique : aucun successeur potentiel
show ip eigrp topology all-links

DUAL: Successeur potentiel	debug eigrp fsm	undebug all
Protocole EIGRP pour IPv6
Configuration du protocole EIGRP pour le processus de routage IPv6
R1(config)# ipv6 unicast-routing
R1(config)# ipv6 router eigrp 2
R1(config-router)# no shutdown
R1(config-router)# eigrp router-id 2.0.0.0

Configuration d'adresses link-local IPv6
R1(config)# int f0/0
R1(config-if)# ipv6 eigrp 1
R1(config-if)# ipv6 address fa80::1 link-local

show ipv6 interface brief
show ipv6 eigrp neighbors
show ipv6 protocols